{
  "forms": [
    {
      "name": "Long Form 2",
      "beltSlug": "green",
      "intro": "This form teaches blocking and countering with multiple strikes.",
      "sequence": [
        { "text": "From a meditating horse stance, step to 12:00 with your right foot into a right neutral bow as you do a left rear elbow and a right inward block into a right slicing outward hand sword (drawing your right hand back to your right hip), a left eye poke to face as you move into a right forward bow, and a right 4-finger poke to the attacker’s solar plexus (1/2 extension) as you move back into a right neutral bow." },
        { "text": "Step through forward into a left neutral bow as you do a right rear elbow and a left inward block into a left slicing outward hand sword (drawing your left hand back to your left hip), a right eye poke to face as you move into a left forward bow, and a left 4-finger poke to the attacker’s solar plexus (1/2 extension) as you move back to a left neutral bow." },
        { "text": "Slide your left foot back into a left transitional cat stance facing 9:00 as you pack your hands (left on top of right) at your right hip, then step out to 9:00 with your left foot into a left neutral bow facing 9:00 while doing a left outward block and right horizontal thrust punch (face level) together. Do a left vertical thrust punch to face level as you draw your right hand to the right side of your chest, followed by a right horizontal thrust punch to face level as you draw your left hand back. Finish with a left vertical snapping punch with a left side kick at knee level." },
        { "text": "Slide your right foot back into a right transitional cat stance facing 9:00 as you pack your hands (right on top of left) at your left hip, then step out to 9:00 with your right foot into a right neutral bow facing 9:00 while doing a right outward block and left horizontal thrust punch (face level) together. Do a right vertical thrust punch to face level as you draw your left hand to the left side of your chest, followed by a left horizontal thrust punch to face level as you draw your right hand back. Finish with a right vertical snapping punch with a right side kick at knee level." },
        { "text": "Slide your left foot back into a left transitional cat stance facing 9:00 as you pack your hands (left on top of right) at your right hip, then step back to 5:00 with your left leg and unwind counterclockwise into a left neutral bow facing 6:00 as you do a left universal block. As you turn into a left forward bow, do a left high block with a right inverted hammerfist to groin level. As you turn back into a neutral bow, switch the upward block into a left downward claw as you snap your right arm up into a back knuckle over your left wrist. Circling your hands, do a left back knuckle to face level followed by a right back knuckle to face level." },
        { "text": "Slide your right foot back into a right transitional cat stance facing 9:00 as you pack your hands (right on top of left) at your left hip, then step back to 1:00 with your right leg and unwind clockwise into a right neutral bow facing 12:00 as you do a right universal block. As you turn into a right forward bow, do a right high block with a left inverted hammerfist to groin level. As you turn back into a neutral bow, switch the upward block into a right downward claw as you snap your left arm up into a back knuckle over your right wrist. Circling your hands, do a right back knuckle to face level followed by a left back knuckle to face level." },
        { "text": "Slide your left foot up into a left transitional cat stance facing 9:00 as you pack your hands (left on top of right) at your right hip, then step back to 4:30 with your right foot and, as you turn into a left neutral bow facing 4:30, do a left downward block that circles down, out, and back into a left back knuckle to the back of the attacker’s head, followed immediately by a right horizontal thrust punch as you draw your left hand back to your hip. Do a left vertical thrust punch with a right ball-thrust kick. As you land from the kick, draw your left hand back to your hip and turn into a right neutral bow facing 4:30 with a right vertical thrust punch." },
        { "text": "Slide your right foot to your left foot, then step out to 7:30 with your right foot into a right neutral bow facing 7:30 while doing a right downward block that circles down, out, and back into a right back knuckle to the back of the attacker’s head, followed immediately by a left horizontal thrust punch as you draw your right hand back to your hip. Do a right vertical thrust punch with a left ball-thrust kick. As you land from the kick, draw your right hand back to your hip and turn into a right neutral bow facing 7:30 with a right vertical thrust punch." },
        { "text": "Do a left front crossover to 10:30 while doing a left overhead heel-palm claw to face level. As you step to 10:30 with your right foot (coming out of the crossover), do a right rising forearm up to face level (right under the chin) with a left two-finger eye poke sliding over your wrist. Finish with right then left two-finger eye pokes." },
        { "text": "Do a right front crossover to 10:30 while doing a right overhead heel-palm claw to face level. As you step to 10:30 with your left foot (coming out of the crossover), do a left rising forearm up to face level (right under the chin) with a right two-finger eye poke sliding over your wrist. Finish with left then right two-finger eye pokes." },
        { "text": "Cock your left hand up by your ear and, as you slide your left leg back to 4:30 into a rear twist stance, do a left inward downward palm-up block (on the kick) with a right rear elbow. Unwind counterclockwise into a right neutral bow as you do a right vertical thrust punch to face level toward 10:30." },
        { "text": "Cock your right hand up by your ear and, as you slide your right leg back to 4:30 into a rear twist stance, do a right inward downward palm-up block (on the kick) with a left rear elbow. Unwind clockwise into a left neutral bow as you do a left vertical thrust punch to face level toward 10:30." },
        { "text": "Step back to 7:30 with your right foot into a left neutral bow facing 1:30 while circling your left hand down, in, and out into a left outward block and immediately into a left snapping back knuckle to 1:30." },
        { "text": "Step through reverse into a right neutral bow facing 1:30 while circling your right hand down, in, and out into a right outward block and immediately into a right snapping back knuckle to 1:30." },
        { "text": "As you move into a right forward bow, do a push-down block to solar plexus level and turn into a front rotating twist stance. From the twist stance, step through forward into a left neutral bow as you do a left side elbow to chest level toward 1:30. Anchor (pull down) your elbow into a left downward heel-palm claw to face level." },
        { "text": "As you move into a left forward bow, do a push-down block to solar plexus level and turn into a front rotating twist stance. From the twist stance, step through forward into a right neutral bow as you do a right side elbow to chest level toward 1:30. Anchor (pull down) your elbow into a right downward heel-palm claw to face level." },
        { "text": "As you move into a right forward bow, do a push-down block to solar plexus level and turn into a front rotating twist stance. From the twist stance, step through forward into a left neutral bow as you do a left side elbow to chest level toward 1:30. Anchor (pull down) your elbow into a left downward heel-palm claw to face level." },
        { "text": "As you turn into a left forward bow, do a right horizontal thrust punch to face level with a left rear elbow, followed (as you turn back into a neutral bow) by a left inward (smothering) block with a right rear elbow." },
        { "text": "Step through reverse into a right neutral bow while doing a right overhead downward elbow." },
        { "text": "Step through reverse into a left neutral bow while doing a left overhead downward elbow." },
        { "text": "Step back with your left foot into a horse stance facing 12:00 as you do a right elbow through your left heel-palm (glancing elbow sandwich) and follow through with the left hand as a four-fingered poke to 3:00." },
        { "text": "Reverse the motion of your arms into left and right side elbows (together) followed by a left upward elbow with a right rear elbow (together)." },
        { "text": "Punch your right fist into your left palm into meditating position, then slide your left leg to your right as you move up into an attention stance." }
      ],
      "footerNotes": [
        "Introduces: Multiple Strikes; Kicks in a form; Finger Pokes; Rotating Twist Stance; Inverted Hammerfist; Vertical Thrust Punch; Inward Elbow; Upward Elbow; Slicing strikes.",
        "Clock angles are all from your original position."
      ]
    }
  ]
}
