{
  "forms": [
    {
      "name": "Form 4",
      "beltSlug": "black",
      "sets": [
        {
          "title": "SET 1: Protecting Fans",
          "steps": [
            { "text": "Have your left foot step forward toward 10:30 into a left neutral bow, delivering a left inward horizontal heel-palm parry to the inside of your opponent's left punch. Right hand cocks at right hip (open, palm up)." },
            { "text": "As your opponent delivers a right punch, pivot into a left forward bow and execute a right extended outward block (handsword) to the outside of the right arm. Left hand cocks to left hip (open, palm up)." },
            { "text": "Immediately pivot right at the waist as you execute a left horizontal finger thrust to the eyes. Simultaneously deliver a right front snapping ball kick to the groin as your right hand grabs the right wrist and pulls diagonally down past your right hip. In the form, return right hand to right hip (open, palm up)." },
            { "text": "Plant right foot toward 3:00 into a horse stance facing 12:00. As you plant, deliver a right inward horizontal elbow (hand open, palm down) to sternum/head while simultaneously delivering a left back elbow (hand open, palm up) to a rear opponent." },
            { "text": "Deliver a left straight finger thrust crossing over right shoulder to rear opponent’s eyes while simultaneously striking with a right back elbow (hand open, palm up)." },
            { "text": "Simultaneously deliver a right straight finger thrust to 12:00 to the eyes while delivering a left downward handsword to block a right kick from 9:00." },
            { "text": "As the 9:00 opponent follows with a right punch, deliver a left vertical outward block (fist) to the inside of his arm while simultaneously delivering a right downward hammerfist to block a left kick from 3:00." },
            { "text": "As the 3:00 opponent follows with a left punch, execute a right vertical outward block (fist) to the inside of his left arm while simultaneously delivering a left snapping inward block (fist) to the inside of a left punch from 9:00. End with matching positions." },
            { "text": "Simultaneously execute two vertical outward snapping back-knuckles to the faces (left fist to 9:00, right fist to 3:00)." },
            { "text": "Curve both shoulders forward/in as strikes convert to two low uppercuts crossing at the navel (left over right): right fist to 9:00, left fist to 3:00." },
            { "text": "Continue circling and convert into two outward overhead claws." },
            { "text": "Convert overhead claws into two slaps along the legs while sliding right foot to left into attention stance, slapping thighs heel-of-palm first then fingers." }
          ]
        },
        {
          "title": "SET 2: Protecting Fans",
          "steps": [
            { "text": "Right foot steps toward 1:30 into right neutral bow with a right inward horizontal heel-palm parry to inside of a right punch. Left hand cocks at left hip (open, palm up)." },
            { "text": "As opponent delivers a left punch, pivot into right forward bow with a left extended outward block (handsword) to outside of left arm. Right hand cocks to right hip (open, palm up)." },
            { "text": "Immediately pivot left at the waist with a right horizontal finger thrust to eyes. Simultaneously deliver a left front snapping ball kick to groin as left hand grabs left wrist and pulls diagonally down past left hip. In the form, return left hand to left hip (open, palm up)." },
            { "text": "Plant left foot toward 9:00 into horse stance facing 12:00. Deliver a left inward horizontal elbow to sternum/head while simultaneously executing a right back elbow (open, palm up) to rear opponent." },
            { "text": "Deliver a right straight finger thrust over left shoulder to rear eyes while simultaneously executing a left back elbow (open, palm up) to rear opponent." },
            { "text": "Simultaneously deliver a left straight finger thrust to 12:00 while delivering a right downward handsword to block a left kick from 3:00." },
            { "text": "As 3:00 opponent follows with a left punch, deliver a right vertical outward block to inside of left arm while simultaneously delivering a left downward hammerfist to block a right kick from 9:00." },
            { "text": "As 9:00 opponent follows with a right punch, execute a left vertical outward block to inside of right arm while simultaneously delivering a right snapping inward block to inside of a right punch from 3:00. End matched." },
            { "text": "Simultaneously execute two vertical outward snapping back-knuckles to faces (left fist to 9:00, right fist to 3:00)." }
          ]
        },
        {
          "title": "SET 3: Darting Leaves",
          "steps": [
            { "text": "From training horse facing 12:00, shift to left leg and drop into a right 45° cat facing 1:30. Deliver a left inward block to outside of right arm (at elbow) as right hand cocks to right hip (open, palm up)." },
            { "text": "Execute a right two-finger vertical eye poke (threaded along back of left wrist) and a right front snapping ball kick toward 1:30 to the groin." },
            { "text": "With hands at their points of contact, plant right foot toward 3:00 on line with left into transitional horse facing 12:00." }
          ]
        },
        {
          "title": "SET 4: Darting Leaves",
          "steps": [
            { "text": "From training horse, shift to right leg and drop into a left 45° cat facing 10:30. Deliver a right inward block to outside of left arm (at elbow) as left hand cocks to left hip (open, palm up)." },
            { "text": "Execute a left two-finger vertical eye poke (threaded along back of right wrist) and a left front snapping ball kick toward 10:30 to the groin." },
            { "text": "With right hand remaining as a positional inward block, plant right foot toward 3:00 on line with left into transitional horse facing 12:00 as left hand re-cocks (fist, palm up) at left hip." }
          ]
        },
        {
          "title": "SET 5: Unfurling Crane",
          "steps": [
            { "text": "Right foot slides back toward 4:30 into left neutral bow facing 10:30 with a left vertical outward block and right downward block (universal block)." },
            { "text": "Shuffle forward to 10:30 with a right vertical outward block and left downward hammerfist to groin." },
            { "text": "From left neutral, deliver a right inward overhead claw (eyebrow level) to face then a left rolling vertical back-knuckle to nose." }
          ]
        },
        {
          "title": "SET 6: Unfurling Crane",
          "steps": [
            { "text": "Left foot slides back toward 7:30 into right neutral facing 1:30 with a right vertical outward block as left hand cocks at left hip (fist, palm up)." },
            { "text": "Shuffle forward to 1:30 with a left vertical outward block and right downward hammerfist to groin." },
            { "text": "From right neutral, deliver a left inward overhead claw (eyebrow level) then a right rolling vertical back-knuckle to nose." }
          ]
        },
        {
          "title": "SET 7: Destructive Kneel",
          "steps": [
            { "text": "Step right foot back toward 6:00 into left transitional neutral (facing 12:00) with a right outward parry to outside of right punch; pivot into left reverse close kneel to buckle back of right knee with left knee. Simultaneously: right hand grabs right wrist, twists clockwise to align elbow, while left inward diagonal heel-palm strikes right elbow, passing under/through." },
            { "text": "Pivot counterclockwise into left close kneel (facing 12:00) with a left outward back-knuckle to right lower ribs and a right inward heel-palm claw across face; drop right knee on opponent’s right ankle." },
            { "text": "Pivot clockwise into right close kneel (toward 4:30) with a right outward back-knuckle to lower spine and a left vertical punch to upper spine (left over right), left knee pressing check." }
          ]
        },
        {
          "title": "SET 8: Destructive Kneel",
          "steps": [
            { "text": "Left foot steps back toward 6:00 into right transitional neutral (facing 12:00) with a left outward parry to outside of left punch; pivot into right reverse close kneel to buckle back of left knee with right knee. Simultaneously: left hand grabs left wrist, twists clockwise to align elbow, and heel-palm passes under/through left arm." },
            { "text": "Pivot counterclockwise into right close kneel (facing 12:00) with a right outward back-knuckle to left lower ribs and a left inward heel-palm claw across face; drop left knee on opponent’s left ankle." },
            { "text": "Pivot clockwise into left close kneel (toward 7:30) with a left outward back-knuckle to lower spine and a right vertical punch to upper spine (right over left), right knee pressing check." }
          ]
        },
        {
          "title": "SET 9: Flashing Wings",
          "steps": [
            { "text": "Execute a right front rotating twist (right foot forward toward 10:30, turn clockwise) with a right extended outward block rising under/outside opponent’s right arm." },
            { "text": "From twist, step left foot to 11:00 into left neutral with a left inward block to outside of opponent’s right knee." },
            { "text": "Pivot into left forward bow and deliver a right inward horizontal elbow to right lower ribs; left hand slides/checks right arm near shoulder." },
            { "text": "Pivot clockwise into horse stance with a right outward elbow heel-palm claw across face; left forearm slides as a check up the right arm." },
            { "text": "Pivot clockwise into left reverse wide kneel (body to 4:30, head to 12:00) with a right outward hooking handsword to back of neck, followed by a left inward handsword to back of neck." },
            { "text": "Pivot counterclockwise into left close kneel as left hand slides down past right shoulder to pin right arm; simultaneously execute a right upward thrusting handsword (palm up) to throat." }
          ]
        },
        {
          "title": "SET 10: Flashing Wings",
          "steps": [
            { "text": "Execute a left front rotating twist (left foot forward toward 1:30, turn counterclockwise) with a left extended outward block rising under/outside opponent’s left arm." },
            { "text": "From twist, step right foot to 1:00 into right neutral with a right inward block to outside of left arm (at/above elbow); left hand cocks to left hip (fist, palm up). Right knee pressing check." },
            { "text": "Pivot into right forward bow and deliver a left inward horizontal elbow to left lower ribs; right hand slides/checks left arm near shoulder." },
            { "text": "Pivot counterclockwise into horse stance with a left outward elbow to left kidney and a right outward heel-palm claw across face; right forearm slides as check up left arm." },
            { "text": "Pivot counterclockwise into right reverse wide kneel (body to 7:30, head to 12:00) with a left outward hooking handsword to back of neck, followed by a right inward handsword to back of neck." },
            { "text": "Pivot clockwise into right close kneel as right hand slides down past left shoulder to pin left arm; simultaneously execute a left upward thrusting handsword (palm up) to throat." }
          ]
        },
        {
          "title": "SET 11: Gathering Clouds",
          "steps": [
            { "text": "Slide left foot toward 6:00 into horse facing 9:00 with a left inward parry to outside of right arm and a right inward vertical middle-knuckle rake through right ribcage." },
            { "text": "Reverse right hand into a right outward handsword to right lower ribs; left hand continues checking the right arm." },
            { "text": "Step right foot forward into right neutral facing 9:00, planting inside his right foot and buckling right knee with your right knee. As you settle, deliver a right inward horizontal elbow to front of right lower ribs while left hand braces at right elbow (elbow sandwich in form)." }
          ]
        },
        {
          "title": "SET 12: Gathering Clouds",
          "steps": [
            { "text": "Left foot steps behind right toward 12:00 into transitional twist; then right foot steps toward 6:00 pivoting on left into horse facing 3:00 with a right inward parry to outside of left arm and a left inward vertical middle-knuckle rake through left ribcage." },
            { "text": "Reverse left hand into a left outward handsword to left lower ribs; right hand continues checking the left arm." },
            { "text": "Step left foot forward into left neutral facing 3:00, planting inside his left foot and buckling left knee with your left knee. As you settle, deliver a left inward horizontal elbow to front of left lower ribs while right hand braces at left elbow (elbow sandwich in form)." }
          ]
        },
        {
          "title": "SET 13: Circles Of Protection",
          "steps": [
            { "text": "Slide left foot back to right into left transitional cat facing 10:30 as you cock right horizontal forearm (obscured from view)." },
            { "text": "Step left foot toward 10:30 into left transitional forward bow with a right upward parry under/outside of right punch (above elbow)." },
            { "text": "Shift into left neutral and deliver a left upward ripping claw to face (under his right arm) while right open hand guards high on right side." },
            { "text": "Circle left hand counterclockwise forcing right arm down/right; simultaneously circle right hand clockwise into a right underhand heel-palm claw to groin, left hand on top of right forearm." },
            { "text": "Shuffle forward (push-drag) delivering a left outward back-knuckle to face while right hand grabs/pulls the testicles; ensure left leg checks. Snap back-knuckle toward right forearm." }
          ]
        },
        {
          "title": "SET 14: Circles Of Protection",
          "steps": [
            { "text": "Execute a left front crossover toward 4:30, cocking left forearm horizontally under right forearm (both horizontal) during cover." },
            { "text": "Complete crossover stepping into right transitional forward bow with a left upward parry under/outside of left punch (above elbow)." },
            { "text": "Shift into right neutral delivering a right upward ripping claw to face (under his left arm) while left open hand guards high on left side." },
            { "text": "Circle right hand counterclockwise forcing left arm down/left; simultaneously circle left hand clockwise into a left underhand heel-palm claw to groin with right hand on top of left forearm." },
            { "text": "Shuffle forward delivering a right outward back-knuckle to face while left hand grabs/pulls testicles; right leg checks." }
          ]
        },
        {
          "title": "SET 15: Dance Of Darkness",
          "steps": [
            { "text": "Right foot steps behind left toward 1:30 into left front twist facing 7:30 with a right outside downward parry to outside of right leg; left hand checks at solar plexus." },
            { "text": "As a right punch follows, step forward with right to 7:00 into right neutral outside his right leg (looking 7:00) and execute double parry: left inward at wrist/forearm then right outward at/above elbow." },
            { "text": "Step left around/behind (toward 7:30) into transitory left neutral with hands cocked right-over-left at left hip; pivot clockwise into right close kneel (facing 12:00) with a right outward back-knuckle and left vertical punch to right kidney/ribs (or left kidney/spine). Right hand on bottom as check." },
            { "text": "Left hand grabs right shoulder and pulls down (height control) while right vertical back-knuckle strikes right temple." },
            { "text": "Execute a left front crossover sweep toward 1:30 to his right leg; as you sweep, drop right punching hand into a small CCW loop and execute a right two-finger hook to his left eye; left hand checks at/near right shoulder." },
            { "text": "Circle left checking hand under/around right arm to track along outside and strike a left two-finger eye poke as left foot plants; right hand now checks." }
          ]
        },
        {
          "title": "SET 16: Dance Of Darkness",
          "steps": [
            { "text": "Pivot into left neutral facing 1:30, hands up. Left foot steps behind right toward 7:30 into right front twist (facing 1:30) with a left outside downward parry to outside of left leg; right hand checks at solar plexus." },
            { "text": "As a left punch follows, step forward with left to 1:00 into left neutral outside his left leg (looking 1:00) and execute double parry: right inward at wrist/forearm then left outward at/above elbow." },
            { "text": "Step right around/behind (between 1:00–2:00) into transitory right neutral with hands cocked left-over-right at right hip; pivot counterclockwise into left close kneel (facing 7:30) with a left outward back-knuckle and right vertical punch to left kidney/ribs (or right kidney/spine). Left hand on bottom as check." },
            { "text": "Right hand grabs left shoulder and pulls down (height control) while left vertical back-knuckle strikes left temple." },
            { "text": "Execute a right front crossover sweep toward 7:30 to his left leg; as you sweep, drop left punching hand into a small clockwise loop and execute a left two-finger hook to his right eye; right hand checks at/near left shoulder." },
            { "text": "Circle right checking hand under/around left arm to track along outside and strike a right two-finger eye poke as right foot plants; left hand now checks." }
          ]
        },
        {
          "title": "SET 17: Thundering Hammers",
          "steps": [
            { "text": "Step left foot toward 9:00 into left neutral facing 9:00 with a left inward block to outside of right arm (at/above elbow). Right arm hangs naturally; check right leg with your left leg." },
            { "text": "Shuffle forward to 9:00, drop into left wide kneel (buckling outside of right knee with your right knee) and strike horizontally across stomach with right inward horizontal forearm as left fist cocks near left ear (palm away)." },
            { "text": "Pivot clockwise dropping lower into right close kneel (facing 1:30), buckling back of right knee with left knee, striking left kidney with left downward hammerfist as right fist cocks near right ear." },
            { "text": "Pivot counterclockwise into left wide kneel (facing 9:00), buckling right knee with right knee; left hand shifts from kidney to horizontal forearm gravitational check atop right shoulder while right downward hammerfist strikes back of neck." },
            { "text": "Switch to right neutral facing 9:00 (left foot back/right foot forward) delivering a right downward back-knuckle to right temple; reverse to a right upward lifting stiff-arm heel-palm to face while left hand checks shoulder down." }
          ]
        },
        {
          "title": "SET 18: Thundering Hammers",
          "steps": [
            { "text": "Immediately pivot counterclockwise into left rotating twist facing 3:00 with a universal block (right inward + left downward)." },
            { "text": "Step right foot to 3:00 into right neutral facing 3:00 with a right inward block to outside of left arm; left arm hangs; check left leg with your right leg." },
            { "text": "Shuffle forward to 3:00, drop into right wide kneel (buckling outside of left knee with your left knee) and strike horizontally across stomach with left inward horizontal forearm as right fist cocks near right ear." },
            { "text": "Pivot counterclockwise dropping into left close kneel (facing 7:30), buckling back of left knee with right knee, striking right kidney with right downward hammerfist as left fist cocks near left ear." },
            { "text": "Pivot clockwise into right wide kneel (facing 3:00) buckling left knee with left knee." },
            { "text": "Shift right hand to horizontal forearm gravitational check atop left shoulder while left downward hammerfist strikes back of neck." },
            { "text": "Switch to left neutral facing 9:00 (right foot back/left forward) delivering a left downward back-knuckle to left temple; reverse to a left upward lifting stiff-arm heel-palm to face while right hand checks shoulder down." }
          ]
        },
        {
          "title": "SET 19: Unwinding Pendulum",
          "steps": [
            { "text": "Right foot drops back toward 1:30 into left front twist facing 7:30." },
            { "text": "Simultaneously execute a right downward block to outside of right leg." },
            { "text": "Cock left hand slightly above solar plexus for a left inward block." },
            { "text": "As right punch follows, pivot clockwise 180° into left neutral facing 7:30 with a left inward block to outside of right arm (preferably at elbow); right arm hangs naturally." },
            { "text": "Execute a right front crossover sweeping kick to the back of the left knee." },
            { "text": "Plant right foot forward into right front twist with a right underhand claw to groin from the rear while left hand horizontally checks elbows." }
          ]
        },
        {
          "title": "SET 20: Unwinding Pendulum",
          "steps": [
            { "text": "Left foot drops back toward 10:30 into right front twist facing 4:30 with a left downward block to outside of left leg; right hand cocks for right inward block." },
            { "text": "As left punch follows, pivot counterclockwise 180° into right neutral facing 4:30 with a right inward block to outside of left arm; left arm hangs naturally." },
            { "text": "Execute a left front crossover sweeping kick to the back of the right knee." },
            { "text": "Plant left foot into left front twist with a left underhand claw to groin from the rear while right hand horizontally checks elbows." }
          ]
        },
        {
          "title": "SET 21: Reversing Circles",
          "steps": [
            { "text": "Right foot steps toward 7:30 into right neutral with a universal block (right downward + left inward) to inside of left leg." },
            { "text": "As opponent plants and punches left, pivot into right forward bow facing 7:30 with a right upward block under/inside left arm while left thrusting heel-palm to left floating ribs (fingers to 10:30)." },
            { "text": "Pivot into right neutral reversing: left becomes an upward block under left arm, right becomes a thrusting heel-palm to left floating ribs (fingers to 4:30). Convert left block to a wrist grab (palm in, thumb up)." }
          ]
        },
        {
          "title": "SET 22: Reversing Circles",
          "steps": [
            { "text": "Left foot drags to right then steps toward 4:30 into left neutral with a universal block (left downward + right inward) to inside of right leg." },
            { "text": "As opponent plants and punches right, pivot into left forward bow facing 4:30 with a left upward block under/inside right arm while right thrusting heel-palm to right floating ribs (fingers to 1:30)." },
            { "text": "Pivot into left neutral reversing: right becomes an upward block under right arm, left becomes a thrusting heel-palm to right floating ribs (fingers to 7:30). Convert right block to a wrist grab (palm in, thumb up)." }
          ]
        },
        {
          "title": "SET 23: Snaking Talon",
          "steps": [
            { "text": "Left foot drops back toward 1:00 into right 45° cat facing 7:30; left hand checks near right cheek (palm up, fingers up) while left handsword positions above left knee (palm to 7:30, fingers down)." },
            { "text": "Right hand loops a figure-eight: right inward handsword over outside/top of right arm then right extended outward handsword outside right arm, crisscrossing arms diagonally down; left hand continues facial check." },
            { "text": "Left hand pulls opponent’s left arm down/left as you deliver a left front snapping ball kick to groin." }
          ]
        },
        {
          "title": "SET 24: Snaking Talon",
          "steps": [
            { "text": "Right foot drops back toward 11:00 into left 45° cat facing 4:30; right hand checks near left cheek (palm up, fingers up) while left handsword positions above left knee (palm to 7:30, fingers down)." },
            { "text": "Left hand loops a figure-eight: left inward handsword over outside/top of right arm then left extended outward handsword outside left arm, diagonally checking height/width; right hand continues facial check." },
            { "text": "Left hand pulls opponent’s left arm down/left as you deliver a left front snapping ball kick to groin." }
          ]
        },
        {
          "title": "SET 25: Circling Fans",
          "steps": [
            { "text": "Plant left foot back in line into horse facing 6:00; cock left hand at left hip (open, palm up)." },
            { "text": "As attack comes from right flank, turn right into right 45° cat facing 9:00; execute right push-down to redirect left punch, then as you settle a left push-down to outside of right punch; right hand cocks to right hip (fist, palm up)." },
            { "text": "Execute a right front ball kick to groin." },
            { "text": "Plant right foot toward 9:00 into horse and execute a right thrusting vertical back-knuckle to face." }
          ]
        },
        {
          "title": "SET 26: Circling Fans",
          "steps": [
            { "text": "Opponent attacks from left flank: turn left into left 45° cat facing 3:00." },
            { "text": "Redirect right punch with a left push-down, then as you settle execute a right push-down to outside of left punch; left hand cocks to left hip (fist, palm up)." },
            { "text": "Execute a left front ball kick to groin." },
            { "text": "Plant left foot toward 3:00 into horse with a left thrusting vertical back-knuckle to face." }
          ]
        },
        {
          "title": "SET 27: Circling Windmills",
          "steps": [
            { "text": "Turn upper body to 6:00 into horse. Execute a combination right upward/right extended outward block to outside of right arm (slightly upward/under). Simultaneously deliver a left heel-palm to solar plexus (fingers in), as if employing a left forearm wedge under the arm." },
            { "text": "Windmill left hand counterclockwise clawing up/out to face while left arm remains in upward-block position to check; simultaneously deliver a right inward hammerfist to left floating ribs." },
            { "text": "Circle right hand clockwise into an upward parry under right arm exposing right side; simultaneously deliver a left inward hammerfist to right floating ribs." },
            { "text": "Reverse left circle (clockwise) to check right arm down/diagonal while delivering a right inward hammerfist diagonally across bridge of nose; finish with left fist cocked at left hip (palm up)." },
            { "text": "Right outward horizontal finger slice (palm down) to eyes; then right inward horizontal finger slice (palm up); then right outward horizontal slice (palm down)." },
            { "text": "Left inward raking back-knuckle to bridge as right hand checks; right hand cocks like a crane near right hip (palm down)." },
            { "text": "Left outward horizontal finger slice (palm down), then left inward (palm up), then left outward slice." },
            { "text": "Left hand cocks near left hip like a crane (palm down)." },
            { "text": "Execute two two-finger overhead whips to eyes." },
            { "text": "Torque palms in facing each other and execute two two-finger thrusts to eyes." },
            { "text": "Torque palms toward face and execute two thumb hooks to eyes." },
            { "text": "Reverse torque toward you and execute two little-finger eye hooks." },
            { "text": "Torque palms toward face and execute two downward heel-palm claws to face, right claw crossing over/behind left." }
          ]
        },
        {
          "title": "SET 28: Defensive Cross",
          "steps": [
            { "text": "As opponent kicks right, step back with right toward 12:00 into left forward bow facing 6:00, executing a braced downward cross block (right over left) atop the ankle." },
            { "text": "Convert left hand into a crane hook inside/under the right foot while right hand stays atop as check; guide leg diagonally down past left hip." },
            { "text": "Orbit hands: convert right hand into an outward overhead back-knuckle to right face, with left trailing; right travels down past right hip (palm to 6:00) and left becomes a left inward overhead heel-palm to right mastoid." },
            { "text": "Convert left heel-palm to a hair/neck grab while delivering a right front snap ball kick to groin." },
            { "text": "Replant right to origin while executing a right upward lifting stiff-arm back-knuckle to face, sandwiching between right knuckle and left grab." }
          ]
        },
        {
          "title": "SET 29: Defensive Cross",
          "steps": [
            { "text": "As opponent kicks left, step back with left toward 12:00 into right forward bow facing 6:00 with a braced downward cross block (left over right) atop ankle." },
            { "text": "Convert right hand into crane hook inside/under left foot while left stays atop as check; guide leg diagonally down past right hip." },
            { "text": "Continue clockwise orbit: convert left into outward overhead back-knuckle to left face with right trailing; left travels down past left hip (palm to 6:00) and right becomes a right inward overhead heel-palm to left mastoid." },
            { "text": "Convert right heel-palm to hair/neck grab while delivering a left front snap ball kick to groin." },
            { "text": "Replant left to origin with a left upward lifting stiff-arm back-knuckle to face, sandwiching between left knuckle and right grab." }
          ]
        },
        {
          "title": "SET 30: Bowing To Buddha",
          "steps": [
            { "text": "As opponent delivers a right roundhouse kick, drop to left knee while executing a right inward block and left extended outward block to inside of the leg; flow into a right forearm parry." },
            { "text": "Shuffle forward (step right, drag left knee) executing a right upward elbow to groin, completing as positional right upward block (palm toward you), simultaneous with a left upward heel-palm to groin." },
            { "text": "With left hand under testicles, pull toward you while delivering a right downward back-knuckle (torque clockwise) to sandwich." }
          ]
        },
        {
          "title": "SET 31: Bowing To Buddha",
          "steps": [
            { "text": "As opponent delivers a left roundhouse, hop to right knee while executing a left inward block and right extended outward block to inside of the leg; flow into a left forearm parry." },
            { "text": "Shuffle forward (step left, drag right knee) executing a left upward elbow to groin, completing as left upward block (palm toward you), simultaneous with a right upward heel-palm to groin." },
            { "text": "With right hand under testicles, pull toward you while delivering a left downward back-knuckle (torque clockwise) to sandwich." }
          ]
        },
        {
          "title": "SET 32: Prance Of The Tiger",
          "steps": [
            { "text": "Opponent from right flank with right step-through uppercut: step right foot back toward 12:00 into left 45° cat (facing 6:00) with a left outside downward hooking parry to inside of right elbow, followed by a right sweeping inside downward block (palm up) to inside of right arm near hand." },
            { "text": "As right hand follows through (cock palm up at left hip), right hand checks; execute a left thrusting sweep kick to shin of right leg while checking with left hand." },
            { "text": "Deliver a right knife-edge kick to inside of left knee (side chicken kick) with a simultaneous right outward back-knuckle to right temple; left hand continues checking." }
          ]
        },
        {
          "title": "SET 33: Prance Of The Tiger",
          "steps": [
            { "text": "Replant right straight down into right 45° cat facing 6:00; cock left fist at left ear for inward block while executing a right push-down block." },
            { "text": "As opponent from left flank with left step-through uppercut, execute right outside downward hooking parry to inside of left elbow, followed by left sweeping inside downward block (palm up) near hand." },
            { "text": "As left hand follows through (cock palm up near right hip), right hand checks; execute a right thrusting sweep kick to shin of left leg while checking with right hand." },
            { "text": "Deliver a left knife-edge kick to inside of right knee (side chicken kick) with a simultaneous left outward back-knuckle to left temple." },
            { "text": "Right hand continues checking." }
          ]
        },
        {
          "title": "SET 34: Shield & Mace",
          "steps": [
            { "text": "Left foot steps toward 9:00 into left transitional neutral facing 9:00; pivot right into horse and deliver a right vertical outward block to outside of right arm while simultaneously delivering a left straight punch to right lower ribs." },
            { "text": "Pivot left and drop into left close kneel striking down with a right hammerfist to top of right kidney driving to pelvis; left hand is a bracing angle check at right elbow." },
            { "text": "Circle left hand clockwise to pin right arm to body while right hand circles counterclockwise into a right looping inward horizontal heel-palm claw to face/eyes." },
            { "text": "Continue counterclockwise circle down along back to strike behind right knee." },
            { "text": "Without rising, follow with a right knife-edge kick to back of left knee." }
          ]
        },
        {
          "title": "SET 35: Shield & Mace",
          "steps": [
            { "text": "Right foot steps toward 3:00 into right transitional neutral facing 3:00; pivot left into horse and deliver a left vertical outward block to outside of left arm while simultaneously delivering a right straight punch to left lower ribs." },
            { "text": "Pivot right and drop into right close kneel striking down with a left hammerfist to top of left kidney driving to pelvis; right hand bracing check at left elbow." },
            { "text": "Circle right hand clockwise to pin left arm to body while left hand circles counterclockwise into a left looping inward horizontal heel-palm claw to face/eyes." },
            { "text": "Continue left counterclockwise circle down along back to strike behind left knee with left handsword; right hand circles to check below left knee." },
            { "text": "Without rising, follow with a left knife-edge kick to back of right knee." }
          ]
        },
        {
          "title": "SET 36: Five Swords",
          "steps": [
            { "text": "From point of contact of left kick, plant left to 9:00 into horse facing 12:00; both hands cock to right hip (right handsword palm up; left handsword palm down, fingers to 3:00)." },
            { "text": "Step right into right neutral facing 12:00 with a left outside downward parry to inside of right kicking leg and a right inward block (handsword) to inside of right punch." },
            { "text": "Immediate right outward handsword to right side of neck." },
            { "text": "Pivot into right forward bow facing 12:00 with a left five-finger thrust (palm down) to eyes while right hand cocks to right hip (fist, palm up)." },
            { "text": "Pivot into right neutral with a right upward thrust to stomach; left hand becomes a horizontal cocking check near right biceps (palm down)." },
            { "text": "Slide left foot counterclockwise toward 4:30 into right forward bow facing 10:30 with a left outward handsword to left side of neck; right hand checks against potential left arm danger." },
            { "text": "Pivot into right neutral with a right inward handsword to back of neck; left hand checks low." }
          ]
        },
        {
          "title": "SET 37: Five Swords",
          "steps": [
            { "text": "Step right toward 9:00, pivot into right transitional rotating twist; execute a right outside downward parry to inside of kicking leg. Step left into left neutral facing 12:00 with a left inward block (handsword) to inside of left punch." },
            { "text": "Immediate left outward handsword to left side of neck." },
            { "text": "Pivot into left forward bow facing 12:00 with a right five-finger thrust (palm down) to eyes while left hand cocks to left hip (fist, palm up)." },
            { "text": "Pivot into left neutral with a left upward thrust to stomach; right hand becomes a horizontal cocking check near left biceps (palm down)." },
            { "text": "Slide right foot counterclockwise toward 4:30 into left forward bow facing 10:30 with a right outward handsword to right side of neck; left hand checks against right arm." },
            { "text": "Pivot into left neutral with a left inward handsword to back of neck; right hand hooks interim around right side of neck and checks low." }
          ]
        },
        {
          "title": "SET 38: Twirling Hammers",
          "steps": [
            { "text": "From left neutral, as opponent executes a left step-through punch, shift left foot slightly right into left front twist with a left extended outward block to outside of left arm (at/above elbow); right hand checks near solar plexus." },
            { "text": "Step right into right neutral facing 12:00 with a right looping overhead back-knuckle to right mastoid while maintaining left extended outward block." },
            { "text": "Continue right loop into a pressing check at opponent’s left lower ribs." },
            { "text": "Convert left elbow strike into an upward hooking wrist check (waiter’s hand)." },
            { "text": "Pivot into right neutral and loop a right inward hammerfist diagonally down to right kidney." }
          ]
        },
        {
          "title": "SET 39: Twirling Hammers",
          "steps": [
            { "text": "From right neutral, as opponent executes a right step-through punch, shift right foot slightly left into right front twist with a right extended outward block to outside of right arm (at/above elbow); left hand checks near solar plexus." },
            { "text": "Step left into left neutral facing 12:00 with a left looping overhead back-knuckle to left mastoid while maintaining right extended outward block." },
            { "text": "Continue the loop into a left pressing check at right elbow." },
            { "text": "Pivot into left forward bow delivering a right inward horizontal elbow to right ribs." },
            { "text": "Convert right elbow into an upward hooking wrist check (waiter’s hand); pivot into left neutral and loop a left inward hammerfist diagonally down to left kidney." }
          ]
        },
        {
          "title": "CLOSING",
          "steps": [
            { "text": "Execute a left front crossover toward 4:30. During cover, cock right clenched fist covered by left open hand near right side." },
            { "text": "Hop to a right one-leg stance with both hands cocked near right ear." },
            { "text": "Plant left toward 9:00 into meditating horse facing 12:00 and up to attention stance." }
          ]
        }
      ]
    }
  ]
}
