{
  "forms": [
    {
      "name": "Short Form 2",
      "beltSlug": "blue",
      "version": "1.0",
      "notes": "Emphasizes stance transitions, angle changes, and back-elbow checks.",
      "sequence": [
        { "text": "Starting from a horse stance..." },
        {
          "text": "Step forward with your right foot toward 12 o’clock into a right neutral bow while executing a right inward block with a left hand cover.",
          "techniques": [{ "slug": "delayed-sword" }]
        },
        {
          "text": "Execute a right outward chop.",
          "techniques": [{ "slug": "alternating-maces" }]
        },
        {
          "text": "Step forward with your left foot toward 12 o’clock into a left neutral bow while executing a left inward block with a right hand cover."
        },
        { "text": "Execute a left outward chop." },
        {
          "text": "Slide your left foot back into a transitional cat stance facing 12 o’clock while placing your right fist on your right hip (palm up), and your left fist on your right fist (saucer & tea cup)."
        },
        {
          "text": "Step out with your left foot into a left neutral bow facing 9 o’clock while executing a left outward block and a right straight punch to 9 o’clock."
        },
        {
          "text": "Slide your right foot into a transitional cat stance facing 12 o’clock while placing your left fist on your left hip (palm up), and your right fist on your left fist (saucer & tea cup)."
        },
        {
          "text": "Step out with your right foot into a right neutral bow facing 3 o’clock while executing a right outward block and a left straight punch to 3 o’clock."
        },
        {
          "text": "Sliding your left foot to 5:30, turn counter clockwise into a left wide kneel (facing 6 o’clock) while simultaneously executing a left upward block and a right hand middle knuckle vertical downward snap, followed by a right middle knuckle vertical thrust to 6 o’clock (elbow bent)."
        },
        {
          "text": "Sliding your left foot to 12:30, turn clockwise into a right wide kneel (facing 12 o’clock) while simultaneously executing a right upward block and a left hand middle knuckle vertical downward snap, followed by a left middle knuckle vertical thrust to 12 o’clock (elbow bent)."
        },
        {
          "text": "Pivot counter clockwise to face 4:30 as you slide your left foot into a cat stance while executing a right inside downward block (palm up) and cocking your left hand at the right shoulder."
        },
        {
          "text": "Step out toward 4:30 into a left neutral bow stance while executing a left downward block with a right back elbow strike."
        },
        {
          "text": "Step through to 4:30 with your right foot into a right neutral bow while executing a right heel of palm thrust to 4:30 with a left hand cover."
        },
        {
          "text": "Slide your right foot back into a right 45 degree cat stance as you pivot clockwise to face 7:30 while executing a left inside downward block (palm up) and cocking your right hand at the left shoulder."
        },
        {
          "text": "Step out toward 7:30 into a right neutral bow while executing a right downward block with a left back elbow strike."
        },
        {
          "text": "Step through toward 7:30 with your left foot into a left neutral bow while executing a left heel of palm thrust to 7:30 with a right hand cover."
        },
        {
          "text": "Slide your right foot back into a right 45 degree cat stance as you pivot clockwise to face 1:30 while executing a left inward block with a right back elbow strike."
        },
        {
          "text": "Step out toward 1:30 with the right foot into a right neutral bow while executing a right extended outward block with a left back elbow strike."
        },
        {
          "text": "Keeping your extended outward block in place, snap out a left half fist (at throat level) toward 1:30 as you pivot into a right forward bow. Immediately return your left fist to your hip as you pivot back into a right neutral bow."
        },
        {
          "text": "Slide your left foot forward into a left 45 degree cat stance as you pivot counter clockwise to face 10:30 while executing a right inward block with a left back elbow strike."
        },
        {
          "text": "Step out toward 10:30 with the left foot into a left neutral bow while executing a left extended outward block with a right back elbow strike."
        },
        {
          "text": "Keeping your extended outward block in place, snap out a right half fist (at throat level) toward 10:30 as you pivot into a left forward bow. Immediately return your right fist to your hip as you pivot back into a left neutral bow."
        },
        {
          "text": "Step forward with your right foot into a horse stance facing 12 o’clock as you bring your right fist to meet your left open hand."
        }
      ],
      "references": {
        "techniques": ["Delayed Sword", "Alternating Maces"]
      }
    }
  ]
}
