{
  "forms": [
    {
      "name": "Short Form 2",
      "beltSlug": "blue",
      "intro": "This form teaches blocking and countering while advancing—building on Short 1 and Long 1. We begin advancing into the attacker as we counter.",
      "sequence": [
        { "text": "From a meditating horse stance, step to 12:00 with your right foot into a right neutral bow with your left hand checking at waist level and do a right inward block into a right outward hand sword." },
        { "text": "Step through forward into a left neutral bow as you slide your right hand straight down to a check at waist level and do a left inward block into a left outward hand sword." },
        { "text": "Slide your left foot back into a left transitional cat stance facing 9:00 as you pack your hands (left on top of right) at your right hip, then step out to 9:00 with your left foot into a left neutral bow facing 9:00 while doing a left outward block and right horizontal thrust punch (face level) together." },
        { "text": "Slide your right foot over into a right transitional cat stance facing 3:00 as you pack your hands (right on top of left) at your left hip, then step out to 3:00 with your right foot into a right neutral bow facing 3:00 while doing a right outward block and left horizontal thrust punch (face level) together." },
        { "text": "Slide your left foot over into a left transitional cat stance facing 3:00 as you pack your hands (left on top of right) at your right hip, then step back to 6:00 with your left foot and sink into a left high wide kneel facing 3:00 while doing a left upward block with a right middle knuckle strike." },
        { "text": "As you rise from the high wide kneel, slide your right foot back into a transitional cat stance facing 9:00 as you pack your hands (right on top of left) at your left hip, then step forward to 12:00 with your right foot and sink into a high wide kneel while doing a right upward block with a left middle knuckle strike." },
        { "text": "As you rise from the high wide kneel, slide your left foot up into a transitional cat stance facing 9:00 as you pack your hands (left on top of right) at your right hip, then step out to 4:30 with a right inward downward palm-up block; as you land in a left neutral bow facing 4:30, do a left downward block on the kick as your right arm pulls back to a rear elbow. Slide your left hand down into a waist-level check as you step through forward into a right neutral bow facing 4:30 while doing a right heel palm at face level." },
        { "text": "Slide your right foot back into a transitional cat stance facing 9:00 as you pack your hands (right on top of left) at your left hip, then step out to 7:30 with a left inward downward palm-up block; as you land in a right neutral bow facing 7:30, do a right downward block on the kick as your left arm pulls back to a rear elbow. Slide your right hand down into a waist-level check as you step through forward into a left neutral bow facing 7:30 while doing a left heel palm at face level." },
        { "text": "Rotate your body 180° clockwise to 1:30 as you slide your right leg back into a cat stance while pulling your right hand back to your waist and doing a left inward block to 1:30. Step out with your right leg into a right neutral bow facing 1:30 while doing a right outward extended block followed by a left horizontal snapping half-fist punch to face level." },
        { "text": "Slide your left foot over into a transitional cat stance facing 9:00 while pulling your left hand back to your waist and doing a right inward block to 10:30. Step out with your left leg into a left neutral bow facing 10:30 while doing a left outward extended block followed by a right horizontal snapping half-fist punch to face level." },
        { "text": "Slide your right leg forward into a horse stance as your right fist punches into your left palm into meditating position, then slide your left leg to your right as you move up into an attention stance." }
      ],
      "footerNotes": [
        "Introduces: Times sign (4 new angles); Checks; Punching and blocking simultaneously; Outward Hand Sword; Middle Knuckle strike; Heel Palm; High Wide Kneel.",
        "Clock angles are all from your original position."
      ]
    }
  ]
}
