{
  "forms": [
    {
      "name": "Long Form 1",
      "beltSlug": "purple",
      "sequence": [
        { "text": "From a horse stance..." },
        { "text": "Have your left foot drop back toward 6 o’clock into a right neutral bow, facing 12 o’clock, as you simultaneously execute a right inward block with a left back elbow strike." },
        { "text": "Pivot into a right forward bow toward 12 o’clock as you execute a left straight punch toward 12 o’clock simultaneously with a right back elbow." },
        { "text": "Have your right foot slide into a right transitional cat stance while executing a right thrusting inward block with a left back elbow strike." },
        { "text": "Complete your right step through by having your right foot plant back toward 6 o’clock into a left neutral bow. As you settle into your left neutral bow simultaneously execute a left inward block with a right back elbow strike." },
        { "text": "Pivot into a left forward bow toward 12 o’clock as you execute a right straight punch to 12 o’clock simultaneously with a left back elbow strike." },
        { "text": "Cover (by moving your right foot toward 3 o’clock) into a left transitory wide kneel stance facing 9 o’clock, while simultaneously executing a right hammering inward block." },
        { "text": "Settle into a left neutral bow facing 9 o’clock, while simultaneously executing a left vertical outward block with a right back elbow strike." },
        { "text": "Pivot into a left forward bow toward 9 o’clock as you execute a right straight punch to 9 o’clock simultaneous with a left back elbow strike." },
        { "text": "Have your left foot commence to drop back toward 3 o’clock into a transitory cat stance facing 9 o’clock, while simultaneously executing a left transitory vertical outward block with a right back elbow strike." },
        { "text": "Have your left foot continue to drop back toward 3 o’clock into a right neutral bow facing 9 o’clock, while simultaneously executing a right vertical outward block with a left back elbow strike." },
        { "text": "Pivot into a right forward bow toward 9 o’clock as you execute a left straight punch to 9 o’clock simultaneous with a right back elbow strike." },
        { "text": "Cover (by having your right foot move toward 9 o’clock), while delivering a left horizontal outward elbow strike." },
        { "text": "Immediately pivot in place into a left neutral bow facing 3 o’clock, while simultaneously executing a left upward block with a right back elbow strike." },
        { "text": "Pivot into a left forward bow toward 3 o’clock as you execute a right straight punch to 3 o’clock simultaneous with a left back elbow strike." },
        { "text": "Have your left foot commence to drop back toward 9 o’clock into a left transitory cat stance facing 3 o’clock, while simultaneously executing a left transitory thrusting inward block with a right back elbow strike." },
        { "text": "Have your left foot continue to drop back toward 9 o’clock into a right neutral bow facing 3 o’clock, while simultaneously executing a right upward block with a left back elbow strike." },
        { "text": "Pivot into a right forward bow toward 3 o’clock as you execute a left straight punch to 3 o’clock simultaneous with a right back elbow strike." },
        { "text": "Cover (this time the right foot steps out toward 6 o’clock) into a right wide kneel facing 6 o’clock, while simultaneously bringing your right arm across your body (right fist palm in at left shoulder) and your left arm across your body as well into a left inside downward block (palm up) as a transitory block." },
        { "text": "Immediately execute a right downward block with a left back elbow strike as you settle into a right neutral bow stance." },
        { "text": "Pivot into a right forward bow toward 6 o’clock as you execute a left straight punch to 6 o’clock simultaneous with a right back elbow strike." },
        { "text": "Have your right foot commence to drop back toward 12 o’clock into a right transitory cat stance facing 6 o’clock, while simultaneously bringing your left arm across your body (left fist palm in at right shoulder) and your right arm across your body as well into a right inside downward block (palm up) as a transitory block." },
        { "text": "Have your right foot continue to drop back toward 12 o’clock into a left neutral bow facing 6 o’clock, while simultaneously executing a left downward block with a right back elbow strike." },
        { "text": "Pivot into a left forward bow toward 6 o’clock as you execute a right straight punch to 6 o’clock simultaneous with a left back elbow strike." },
        { "text": "Pivot back into a left neutral bow facing 6 o’clock, while simultaneously executing a left inward block with a right back elbow strike." },
        { "text": "Execute a right inward block with a left back elbow strike." },
        { "text": "Execute a left inward block with a right back elbow strike." },
        { "text": "Your left foot steps back toward 12 o’clock into a right neutral bow facing 6 o’clock, while simultaneously executing a right inward block with a left back elbow strike." },
        { "text": "Execute a left inward block with a right back elbow strike." },
        { "text": "Execute a right inward block with a left back elbow strike." },
        { "text": "Cover (by moving your left foot toward 3 o’clock) into a right wide kneel facing 9 o’clock, while simultaneously executing a left transitory thrusting inward block with a right back elbow strike." },
        { "text": "Settle into a right neutral bow facing 9 o’clock, while simultaneously executing a right vertical outward block with a left back elbow strike." },
        { "text": "Execute a left vertical outward block with a right back elbow strike." },
        { "text": "Execute a right vertical outward block with a left back elbow strike." },
        { "text": "Have your right foot commence to drop back toward 3 o’clock into a right transitory cat stance facing 9 o’clock, while simultaneously executing a right transitory hammering inward block with your left arm remaining in place." },
        { "text": "Have your right foot continue to drop back toward 3 o’clock as you settle into a left neutral bow facing 9 o’clock, while simultaneously executing a left vertical outward block with a right back elbow strike." },
        { "text": "Execute a right vertical outward block with a left back elbow strike." },
        { "text": "Execute a left vertical outward block with a right back elbow strike." },
        { "text": "Cover (by moving your left foot toward 9 o’clock) into a right wide kneel facing 3 o’clock, while simultaneously executing a left transitory hammering inward block with your left arm remaining in place." },
        { "text": "Settle into a right neutral bow facing 3 o’clock, while simultaneously executing a right upward block with a left back elbow strike." },
        { "text": "Execute a left upward block with a right back elbow strike." },
        { "text": "Execute a right upward block with a left back elbow strike." },
        { "text": "Have your right foot commence to drop back toward 9 o’clock into a right transitory cat stance facing 3 o’clock, while simultaneously executing a right transitory hammering inward block with your left arm remaining in place." },
        { "text": "Your right foot drops back toward 9 o’clock into a left neutral bow facing 3 o’clock, while simultaneously executing a left upward block with a right back elbow strike." },
        { "text": "Execute a right upward block with a left back elbow strike." },
        { "text": "Execute a left upward block with a right back elbow strike." },
        { "text": "Cover (by moving your right foot toward 6 o’clock) into a left wide kneel stance facing 12 o’clock, while simultaneously bringing your left arm across your body (left fist palm in at right shoulder) and your right arm across your body as well into a right inside downward block (palm up) as a transitory block." },
        { "text": "Settle into a left neutral bow facing 12 o’clock, while simultaneously executing a left downward block with a right back elbow strike." },
        { "text": "Execute a right downward block with a left back elbow strike." },
        { "text": "Execute a left downward block with a right back elbow strike." },
        { "text": "Have your left foot commence to drop back toward 6 o’clock into a left transitory cat stance facing 12 o’clock, while simultaneously bringing your right arm across your body (right fist palm in at left shoulder) and your left arm across your body as well into a left inside downward block (palm up) as a transitory block." },
        { "text": "Have your left foot continue to drop back toward 6 o’clock into a right neutral bow facing 12 o’clock, while simultaneously executing a right downward block with a left back elbow strike." },
        { "text": "Execute a left downward block with a right back elbow strike." },
        { "text": "Execute a right downward block with a left back elbow strike." },
        { "text": "Have your left foot move up (toward 9 o’clock), and in line with your right foot, as you form a horse stance facing 12 o’clock. Simultaneously execute a left inside downward block (palm down) with a right back elbow strike." },
        { "text": "Execute a right inside downward block (palm down) with a left back elbow strike." },
        { "text": "Execute a left inside downward block (palm down) with a right back elbow strike." },
        { "text": "Execute a right inside downward block (palm up) with a left back elbow strike." },
        { "text": "Execute a left inside downward block (palm up) with a right back elbow strike." },
        { "text": "Execute a right inside downward block (palm up) with a left back elbow strike." },
        { "text": "Execute a left push-down block with a right back elbow strike." },
        { "text": "Execute a right push-down block with a left back elbow strike." },
        { "text": "Execute a left push-down block with a right back elbow strike." },
        { "text": "Execute a right straight punch to 12 o’clock with a left back elbow strike." },
        { "text": "Execute a left straight punch to 12 o’clock with a right back elbow strike." },
        { "text": "Execute a right straight punch to 10:30 with a left back elbow strike." },
        { "text": "Execute a left straight punch to 1:30 with a right back elbow strike." },
        { "text": "Execute a right straight punch to 9 o’clock with a left back elbow strike." },
        { "text": "Execute a left straight punch to 3 o’clock with a right back elbow strike." },
        { "text": "Execute a right uppercut punch to 12 o’clock with a left back elbow strike." },
        { "text": "Execute a left uppercut punch to 12 o’clock with a right back elbow strike." },
        { "text": "Have your left hand open in place as your right fist uppercuts into the left open palm." }
      ]
    }
  ]
}
