{
  "name": "Form 6",
  "belt_slug": "3rd-degree-black",
  "summary": "This technique form shows weapon techniques—each attack is a knife, club, or gun. Emphasis is on continuous hand motion and flowing checks.",
  "notes": [
    "Focus on uninterrupted hand motion from one positional check to the next.",
    "Keep weapon-hand control tight; favor outside lines and immediate checks after strikes."
  ],
  "sets": [
    {
      "title": "SET 1: Glancing Lance",
      "steps": [
        { "number": 1, "text": "Step to 6:00 with your right foot into a left neutral bow while doing a low right outward hooking parry at attacker’s wrist to redirect the knife, immediately grabbing the wrist as you do a left upward heel palm to the underside of the elbow." },
        { "number": 2, "text": "While pulling the arm past your right hip, do a right rear ball kick to the groin followed by a right two-finger eye poke/hook (release right hand and check the arm with your left). Land inside attacker’s right leg, buckling the knee." },
        { "number": 3, "text": "Follow through with the eye poke/hook counter-clockwise to check the right arm as you cock your right leg to left knee (one-leg stance) and do a right side kick to the back of attacker’s right knee." },
        { "number": 4, "text": "As you land, continue the counter-clockwise circle of your right hand into a right heel palm to the face. Anchor your right elbow to help check the arm and do a left middle-knuckle strike to the right mastoid followed by a right elbow (sandwiched with your left hand)." },
        { "number": 5, "text": "Slide your left foot back to attention, circling hands out and up into double push-down blocks in front of you." }
      ]
    },
    {
      "title": "SET 2: Glancing Lance",
      "steps": [
        { "number": 1, "text": "Step to 6:00 with your left foot into a right neutral bow while doing a low left outward hooking parry to redirect the knife, immediately grabbing the wrist as you do a right upward heel palm to the underside of the elbow." },
        { "number": 2, "text": "While pulling the arm past your left hip, do a left rear ball kick to the groin followed by a left two-finger eye poke/hook (release left hand and check with your right). Land inside attacker’s left leg, buckling the knee." },
        { "number": 3, "text": "Follow through with the poke/hook counter-clockwise to check the left arm as you cock your left leg to right knee (one-leg stance) and do a left side kick to the back of attacker’s left knee." },
        { "number": 4, "text": "As you land, continue the counter-clockwise circle of your left hand into a left heel palm to the face. Anchor your elbow and do a right middle-knuckle to the left mastoid followed by a left elbow (sandwiched with your right hand)." }
      ]
    },
    {
      "title": "SET 3: Unfurling Lance",
      "steps": [
        { "number": 1, "text": "As the 3:00 attacker lunges chest-level with a knife, slide your right leg back into a cat stance facing 3:00 with a right inward parry followed by a left outward parry." },
        { "number": 2, "text": "Immediately do a right front ball kick to the groin as your right hand cocks at your right hip." },
        { "number": 3, "text": "Do a right hooking middle-knuckle to the inside of attacker’s right bicep, follow through and as you shuffle in, circle into a right side elbow to the face." },
        { "number": 4, "text": "Do a left overhead claw to the face followed by a right back knuckle to the face." },
        { "number": 5, "text": "Slide your left foot to your right, reversing strike line into a right hammerfist to the groin while the left hand checks at face level." },
        { "number": 6, "text": "Right obscure upward elbow through the chin into a right upward claw to the face while doing a left heel palm to solar plexus and a right front scoop kick to the groin." },
        { "number": 7, "text": "Right front ball kick to attacker’s right knee and a right inward handsword to the neck as you land." }
      ]
    },
    {
      "title": "SET 4: Unfurling Lance",
      "steps": [
        { "number": 1, "text": "As the 9:00 attacker lunges chest-level with a knife, slide your left leg back into a cat stance facing 9:00 with a left inward parry followed by a right outward parry." },
        { "number": 2, "text": "Immediately do a left front ball kick to the groin as your left hand cocks at your left hip." },
        { "number": 3, "text": "Do a left hooking middle-knuckle to the inside of attacker’s left bicep, follow through and as you shuffle in, circle into a left side elbow to the face." },
        { "number": 4, "text": "Do a right overhead claw to the face followed by a left back knuckle to the face." },
        { "number": 5, "text": "Slide your right foot to your left, reversing strike line into a left hammerfist to the groin while the right hand checks at face level." },
        { "number": 6, "text": "Left obscure upward elbow through the chin into a left upward claw to the face while doing a right heel palm to solar plexus and a left front scoop kick to the groin." },
        { "number": 7, "text": "Left front ball kick to attacker’s left knee and a left inward handsword to the neck as you land." }
      ]
    },
    {
      "title": "SET 5: Clipping The Lance",
      "steps": [
        { "number": 1, "text": "As the 1:30 attacker lunges with a waist-level knife, step back to 7:30 with your right foot into a transitional left front twist stance while doing a right downward side elbow to deflect the knife past your right hip." },
        { "number": 2, "text": "Unwind into a left neutral bow with a left inward handsword to the forearm, raising your right hand high on your right side." },
        { "number": 3, "text": "Right inward handsword to the wrist as your left cocks to chest, then left outward handsword to the neck." },
        { "number": 4, "text": "Move into a left forward bow and cock your left to your hip as you do a right four-finger eye poke to the face." },
        { "number": 5, "text": "Slide right foot up to left with a right middle-knuckle to ribs, then step through to 1:30 into a right neutral bow with a right heel palm to the face." }
      ]
    },
    {
      "title": "SET 6: Clipping The Lance",
      "steps": [
        { "number": 1, "text": "As the 10:30 attacker lunges with a waist-level knife, step back to 4:30 with your left foot into a transitional right front twist stance while doing a left downward side elbow to deflect past your left hip." },
        { "number": 2, "text": "Unwind into a right neutral bow with a right inward handsword to the forearm, raising your left hand high on your left side." },
        { "number": 3, "text": "Left inward handsword to the wrist as your right cocks to chest, then right outward handsword to the neck." },
        { "number": 4, "text": "Move into a right forward bow and cock your right to hip as you do a left four-finger eye poke to the face." },
        { "number": 5, "text": "Slide left foot up to right with a left middle-knuckle to ribs, then step through to 10:30 into a left neutral bow with a left heel palm to the face." }
      ]
    },
    {
      "title": "SET 7: Thrusting Lance",
      "steps": [
        { "number": 1, "text": "Slide your left foot back toward your right into a cat stance with a left inward block." },
        { "number": 2, "text": "As the 12:00 attacker lunges waist-level, step back to 6:00 with your left foot into a right neutral bow facing 12:00 with a right inward/downward block to deflect past your left hip." },
        { "number": 3, "text": "While checking the right arm with your right, push-drag forward with a left inverted (underhand) heel palm to the groin." },
        { "number": 4, "text": "Bring left hand to assist right in grabbing the wrist; rotate clockwise to lock the wrist and bend attacker at the waist as you step back with your right into a left neutral bow." },
        { "number": 5, "text": "Chicken kick (left first) to the face, landing in a right neutral bow tight to attacker; release right hand and guide the arm past your right hip with your left hand." },
        { "number": 6, "text": "As you land, right rising back knuckle to face, right hammerfist to back of neck, then back knuckle to right mastoid." }
      ]
    },
    {
      "title": "SET 8: Thrusting Lance",
      "steps": [
        { "number": 1, "text": "As the 12:00 attacker lunges waist-level, step back to 6:00 with your right foot into a left neutral bow facing 12:00 with a left inward/downward block to deflect past your right hip." },
        { "number": 2, "text": "While checking the left arm with your left, push-drag forward with a right inverted (underhand) heel palm to the groin." },
        { "number": 3, "text": "Bring right hand to assist left in grabbing the wrist; rotate clockwise to lock the wrist and bend attacker at the waist as you step back with your left into a right neutral bow." },
        { "number": 4, "text": "Chicken kick (right first) to the face, landing in a left neutral bow tight to attacker; release left hand and guide the arm past your left hip with your right hand." },
        { "number": 5, "text": "As you land, left rising back knuckle to face, left hammerfist to back of neck, then back knuckle to left mastoid." }
      ]
    },
    {
      "title": "SET 9: Raining Lance",
      "steps": [
        { "number": 1, "text": "As the 9:00 attacker comes with an overhead knife, step to 1:30 with your right foot and turn CCW into a left neutral bow, extend right arm down-out-down. Do a left downward block scraping down your right arm to guide the knife past and into attacker’s groin." },
        { "number": 2, "text": "Left arm checks at solar plexus. Push-drag forward with a right inward elbow to the chest." },
        { "number": 3, "text": "Turn into a reverse bow, switch hands—right checks low while left does an inverted claw (palm up) to throat." },
        { "number": 4, "text": "Switch again—left checks low while right inward handsword to nose into right heel-palm claw across the face." }
      ]
    },
    {
      "title": "SET 10: Raining Lance",
      "steps": [
        { "number": 1, "text": "As the 3:00 attacker comes with an overhead knife, step to 10:30 with your left foot and turn CCW into a right neutral bow, extend left arm down-out-down. Do a right downward block scraping down your left arm to guide the knife past and into attacker’s groin." },
        { "number": 2, "text": "Right arm checks at solar plexus. Push-drag forward with a left inward elbow to the chest." },
        { "number": 3, "text": "Turn into a reverse bow, switch hands—left checks low while right inverted claw (palm up) to throat." },
        { "number": 4, "text": "Switch again—right checks low while left inward handsword to nose into left heel-palm claw across the face." }
      ]
    },
    {
      "title": "SET 11: Capturing The Storm",
      "steps": [
        { "number": 1, "text": "As the 12:00 attacker comes with a right overhead club, step forward to 12:00 with your left foot into a left neutral bow with a high cross block (right wrist over left) to stop the club." },
        { "number": 2, "text": "Turn clockwise in place to 4:30 into a right reverse bow while grabbing the right wrist with both hands and pulling the arm across your upper arm to break the elbow." },
        { "number": 3, "text": "Turn CCW to 10:30, sink into a left high wide kneel, swing the arm/club down onto attacker’s right shin and step-through forward past attacker." },
        { "number": 4, "text": "Immediately turn CCW and step-through reverse into a left neutral bow facing 4:30 while raising the arm over your head and stripping the club with your right hand." },
        { "number": 5, "text": "Strike across the head with the club (to your right), then down and across the front of the right leg, then back across the back of the leg." },
        { "number": 6, "text": "Without pausing, step to 6:00 with your left foot into a transitional left front twist stance as you strike up to the face with the club." }
      ]
    },
    {
      "title": "SET 12: Capturing The Storm",
      "steps": [
        { "number": 1, "text": "As the 6:00 attacker comes with a left overhead club, step forward to 6:00 with your right foot into a right neutral bow with a high cross block (left wrist over right) to stop the club." },
        { "number": 2, "text": "Turn clockwise in place to 1:30 into a left reverse bow, grab the left wrist with both hands and pull the arm across your upper arm to break the elbow." },
        { "number": 3, "text": "Turn CCW to 7:30, sink into a right high wide kneel, swing the arm/club down onto attacker’s left shin and step-through forward past attacker." },
        { "number": 4, "text": "Immediately turn CCW and step-through reverse into a right neutral bow facing 1:30 while raising the arm over your head and stripping the club with your left hand." },
        { "number": 5, "text": "Strike across the head with the club (to your left), then down and across the front of the left leg, then back across the back of the leg." },
        { "number": 6, "text": "Without pausing, step to 12:00 with your right foot into a transitional right front twist stance as you strike up to the face with the club." }
      ]
    },
    {
      "title": "SET 13: Circling The Storm",
      "steps": [
        { "number": 1, "text": "As the 12:00 attacker thrusts chest-high with a club, step to 12:00 with your left into a left neutral bow with a left inward block on the arm." },
        { "number": 2, "text": "Slide your left hand to the elbow (redirect right) and step through past attacker’s right leg with a right glancing elbow to ribs." },
        { "number": 3, "text": "As you land, pivot CCW into a left neutral bow facing 6:00 with a left outward elbow to ribs while right hand checks attacker’s right arm." },
        { "number": 4, "text": "Right heel-palm claw up through the right side of the face as you hop slightly back to 11:00, land in a left transitional crane behind attacker and do a right side kick to the back of the left knee. As you land, continue the heel-palm motion into an inverted eagle’s beak to the groin from behind." },
        { "number": 5, "text": "With left hand checking high, circle right into another heel-palm claw across the face into a check on the back." },
        { "number": 6, "text": "Left thrusting sweep of attacker’s right leg (toward 6:00) with a left-handed eagle’s beak to the groin from behind, ending in a left front twist stance." }
      ]
    },
    {
      "title": "SET 14: Circling The Storm",
      "steps": [
        { "number": 1, "text": "As the 6:00 attacker thrusts chest-high with a club, step to 6:00 with your right into a right neutral bow with a right inward block on the arm." },
        { "number": 2, "text": "Slide your right hand to the elbow (redirect left) and step through past attacker’s left leg with a left glancing elbow to ribs." },
        { "number": 3, "text": "As you land, pivot CCW into a right neutral bow facing 12:00 with a right outward elbow to ribs while left hand checks attacker’s left arm." },
        { "number": 4, "text": "Left heel-palm claw up through the left side of the face as you hop slightly back to 7:00, land in a right transitional crane behind attacker and do a left side kick to the back of the right knee. As you land, continue the heel-palm into an inverted eagle’s beak to the groin from behind." },
        { "number": 5, "text": "With right hand checking high, circle left into another heel-palm claw across the face into a check on the back." },
        { "number": 6, "text": "Right thrusting sweep of attacker’s left leg (toward 12:00) with a right-handed eagle’s beak to the groin from behind, ending in a right front twist stance." }
      ]
    },
    {
      "title": "SET 15: Escape From The Storm",
      "steps": [
        { "number": 1, "text": "Left knee to 12:00, land in a left neutral bow facing 12:00." },
        { "number": 2, "text": "As the 3:00 attacker overhead-swings with a club, slide right foot back to left and step out to 3:00 while doing a left high inward parry on the arm/stick and a right heel palm to the face." },
        { "number": 3, "text": "As you begin to step-through forward, drive right elbow down into solar plexus, immediately whip forearm down into a heel palm to the groin as you settle into a left neutral bow facing 3:00." },
        { "number": 4, "text": "Slide left hand down the outside of attacker’s right leg and, as you slide right leg out wide and back to 3:00 into a deep left forward bow facing 9:00, hook the leg up with right hand and do a left inward elbow to lower back to knock them forward. End with both hands in crane hooks on your right side." },
        { "number": 5, "text": "Step to 9:00 with your right into a right front twist stance and sink to break attacker’s right knee over your right thigh." },
        { "number": 6, "text": "Left inward heel palm to attacker’s right leg to clear it, then right front underhand eagle’s beak to the groin." },
        { "number": 7, "text": "Shift stance CCW into reverse bow and continue with a right rear underhand eagle’s beak to the groin." },
        { "number": 8, "text": "Shift stance CW back to 9:00 and do a left thrusting sweep to 9:00 on attacker’s right leg with a left front underhand eagle’s beak to the groin, ending in a left front twist stance." }
      ]
    },
    {
      "title": "SET 16: Escape From The Storm",
      "steps": [
        { "number": 1, "text": "Right knee to 9:00, land in a right neutral bow facing 9:00." },
        { "number": 2, "text": "As the 9:00 attacker overhead-swings with a club, slide left foot up to right and step out to 9:00 with a right high inward parry and a left heel palm to the face." },
        { "number": 3, "text": "As you begin to step-through forward, drive left elbow down into solar plexus, immediately whip forearm down into a heel palm to the groin as you settle into a right neutral bow facing 9:00." },
        { "number": 4, "text": "Slide right hand down the outside of attacker’s left leg and, as you slide left leg out wide and back to 3:00 into a deep right forward bow facing 3:00, hook the leg up with left hand and do a right inward elbow to lower back to knock them forward. End with both hands in crane hooks on your left side." },
        { "number": 5, "text": "Step to 3:00 with your left into a left front twist stance and sink to break attacker’s left knee over your left thigh." },
        { "number": 6, "text": "Right inward heel palm to attacker’s left leg to clear it, then left front underhand eagle’s beak to the groin." },
        { "number": 7, "text": "Shift stance CW into reverse bow and continue with a left rear underhand eagle’s beak to the groin." },
        { "number": 8, "text": "Shift stance CCW back to 3:00 and do a right thrusting sweep to 3:00 on attacker’s left leg with a right front underhand eagle’s beak to the groin, ending in a right front twist stance." }
      ]
    },
    {
      "title": "SET 17: Entwined Lance",
      "steps": [
        { "number": 1, "text": "Step to 12:00 with your left into a left front twist stance while doing a left outward hooking parry and cocking your right hand (palm down) to the left side of your chest." },
        { "number": 2, "text": "Step through to 12:00 with your right into a right neutral bow; convert left hooking parry to a grab on the wrist and do a right outward handsword to the throat." },
        { "number": 3, "text": "Right hand slides down attacker’s right arm to grab near the wrist; do a right thrusting sweep to attacker’s right leg with a left two-finger eye poke." },
        { "number": 4, "text": "Switch—left grabs the wrist while right back knuckle to ribs and right side kick to inside of attacker’s left knee." }
      ]
    },
    {
      "title": "SET 18: Entwined Lance",
      "steps": [
        { "number": 1, "text": "Step to 12:00 with your right into a right front twist stance while doing a right outward hooking parry and cocking your left hand (palm down) to the right side of your chest." },
        { "number": 2, "text": "Step through to 12:00 with your left into a left neutral bow; convert right hooking parry to a grab on the wrist and do a left outward handsword to the throat." },
        { "number": 3, "text": "Left hand slides down attacker’s left arm to grab near the wrist; do a left thrusting sweep to attacker’s left leg with a right two-finger eye poke." },
        { "number": 4, "text": "Switch—right grabs the wrist while left back knuckle to ribs and left side kick to inside of attacker’s right knee." }
      ]
    },
    {
      "title": "SET 19: Captured Rod",
      "steps": [
        { "number": 1, "text": "As the 3:00 attacker steps in with a gun to your face, step to 3:00 with your right foot; left outward parry at the thumb (turn into a grab) while doing a right inward (palm down) eye slice, then bring right hand down to grab attacker’s right hand." },
        { "number": 2, "text": "While right maintains the grab, do a left four-finger eye poke." },
        { "number": 3, "text": "Return left to attacker’s right hand and, as you step back with your right foot, use both hands to twist the wrist clockwise back toward attacker (thumbs on back, fingers on front—as in lock flows)." },
        { "number": 4, "text": "With your right hand, pull the gun out and back past your right hip while doing a right rear ball kick to the groin. Land checking inside of attacker’s right leg; slide left hand up to the elbow as the arm passes your right hip and strike up with the gun to the face." }
      ]
    },
    {
      "title": "SET 20: Captured Rod",
      "steps": [
        { "number": 1, "text": "As the 9:00 attacker steps in with a gun to your face, step to 6:00 with your left and rotate CCW into a left neutral bow facing 9:00; right outward parry at the thumb (into a grab) while doing a left inward (palm down) eye slice, then bring left down to grab attacker’s left hand." },
        { "number": 2, "text": "While left maintains the grab, do a right four-finger eye poke." },
        { "number": 3, "text": "Return right to attacker’s left hand and, as you step back with your left foot, use both hands to twist the wrist clockwise back toward attacker (thumbs on back, fingers on front—as in lock flows)." },
        { "number": 4, "text": "With your left hand, pull the gun out and back past your left hip while doing a left rear ball kick to the groin. Land checking inside of attacker’s left leg; slide right hand up to the elbow as the arm passes your left hip and strike up with the gun to the face." }
      ]
    }
  ],
  "related_techniques": []
}
