{
  "forms": [
    {
      "name": "Form 5",
      "beltSlug": "black",
      "intro": "This is a technique form showing all takedown techniques—each technique takes the attacker to the ground in some way.",
      "sets": [
        {
          "title": "SET 1: Destructive Fans",
          "steps": [
            { "text": "As attacker throws a right punch from 9:00, step back slightly to 7:30 with your left foot while doing a right outward parry followed by a left inward parry and a right inward hammerfist to the hip." },
            { "text": "Slide your left foot in front of your right foot into a front twist stance (sweeping the attacker) while doing a right overhead claw to the face." },
            { "text": "Unwind clockwise from the twist and step-through reverse with your right foot while doing a left low inward block and a right thrust punch (aimed low), ending in a left forward bow facing 9:00." }
          ]
        },
        {
          "title": "SET 2: Destructive Fans",
          "steps": [
            { "text": "As the 3:00 attacker throws a left punch, step back slightly to 4:30 with your right foot as you do a left outward parry followed by a right inward parry and a left inward hammerfist to the hip." },
            { "text": "Slide your right foot in front of your left foot into a front twist stance (sweeping the attacker) while doing a left overhead claw to the face." },
            { "text": "Unwind counterclockwise from the twist and step-through reverse with your left foot while doing a right low inward block and a left thrust punch (aimed low), ending in a right forward bow facing 3:00." }
          ]
        },
        {
          "title": "SET 3: Dance Of Death",
          "steps": [
            { "text": "As the 12:00 attacker throws a right kick followed by a right punch, slide your right foot up to your left foot while doing a left downward block on the kick. Immediately slide your right foot back to 6:00 as you do a left inward parry on the punch followed by a right ridge hand to the groin as you turn into a left forward bow." },
            { "text": "As you step to 12:00 with your right foot, do a right inward elbow while your left hand grabs and lifts the attacker’s right leg to knock them onto their back." },
            { "text": "Do a right outward back knuckle to the attacker’s left leg followed by (continuing the counterclockwise circle) a right downward handsword to the groin—both strikes to the outside of your right leg." },
            { "text": "With both hands, grab the attacker’s foot (near your left shoulder) and twist it clockwise to flip the attacker over." },
            { "text": "As the attacker lands on their stomach, stomp their spine with your left foot as you step over them toward 3:00." },
            { "text": "Pivot counterclockwise into a left close kneel stance and deliver a right handsword to the back of the neck." },
            { "text": "Rise up, lift your right foot high, stomp it down on the attacker’s spine and step to the other side (to 9:00) with your left foot." },
            { "text": "As you plant your left foot, do a right side kick (aimed at the ground) to the ribs while your hands stretch out high in the opposite direction." },
            { "text": "Following the kick, plant your right foot to 10:30 and turn counterclockwise to face 6:00 in a left neutral bow." }
          ]
        },
        {
          "title": "SET 4: Dance Of Death",
          "steps": [
            { "text": "As the 6:00 attacker throws a left kick followed by a left punch, step back to 12:00 with your left foot while doing a right downward block on the kick. Do a right inward block on the punch followed by a left ridge hand to the groin as you turn into a right forward bow." },
            { "text": "As you step to 7:30 with your left foot, do a left inward elbow while your right hand grabs and lifts the attacker’s left leg to knock them onto their back." },
            { "text": "Do a left outward back knuckle to the attacker’s right leg followed by (continuing the clockwise circle) a left downward handsword to the groin—both strikes to the outside of your left leg." },
            { "text": "With both hands, grab the attacker’s foot (near your right shoulder) and twist it counterclockwise to flip the attacker over." },
            { "text": "As the attacker lands on their stomach, stomp their spine with your right foot as you step over them toward 3:00." },
            { "text": "Pivot clockwise into a right close kneel stance and deliver a left handsword to the back of the neck." },
            { "text": "Rise up, lift your left foot high, stomp it down on the attacker’s spine and step to the other side (to 9:00) with your right foot." },
            { "text": "As you plant your left foot, do a left side kick (aimed at the ground) to the ribs while your hands stretch out high in the opposite direction." },
            { "text": "Following the kick, plant your right foot to 7:30 into a transitional front twist stance." }
          ]
        },
        {
          "title": "SET 5: Leap Of Death",
          "steps": [
            { "text": "As the 9:00 attacker throws a right punch, unwind clockwise from the twist stance with a right outward parry to deflect the punch and convert to a right grab on the wrist." },
            { "text": "Push-drag toward 3:00 into a right close kneel facing 4:30, buckling the attacker’s right knee with your left knee while doing a left upward heel palm to the right elbow (that misses) followed by a left back knuckle to the ribs." },
            { "text": "Drive your left elbow up into the attacker’s armpit and push down as you pull up on the wrist with your right hand to drop them face-first toward 3:00." },
            { "text": "Leap onto the attacker’s back, scraping your heels down the sides of the ribcage. Squat into a diamond stance and deliver double heel palms to the back of the head, driving the face into the ground." },
            { "text": "Wrap your hands around the front of the head and pull it back, turn your knees into a concave stance. Draw your right hand back (maintaining the head control with your left) and deliver a right inward handsword to the face." },
            { "text": "Turn to your right as you drive your left knee into the middle of the back while delivering a left heel palm to the back of the head." },
            { "text": "Stand up, step across the body with your left foot and do a right side kick to the head; plant your right foot to 9:30 and step back to 7:30 with your left foot." }
          ]
        },
        {
          "title": "SET 6: Leap Of Death",
          "steps": [
            { "text": "As the 3:00 attacker throws a left punch, do a left outward parry to deflect and convert to a left grab on the wrist." },
            { "text": "Push-drag toward 9:00 into a left close kneel facing 7:30, buckling the attacker’s left knee with your right knee while doing a right upward heel palm to the left elbow (that misses) followed by a right back knuckle to the ribs." },
            { "text": "Drive your right elbow up into the attacker’s armpit and push down as you pull up on the wrist with your left hand to drop them face-first toward 9:00." },
            { "text": "Leap onto the back, scraping heels down the ribcage. Squat into a diamond stance and deliver double heel palms to the back of the head, driving the face into the ground." },
            { "text": "Wrap hands around the front of the head and pull it back; turn knees into a concave stance. Draw your left hand back (maintaining control with your right) and deliver a left inward handsword to the face." },
            { "text": "Turn to your left as you drive your right knee into the middle of the back while delivering a right heel palm to the back of the head." },
            { "text": "Stand up, step across the body with your right foot and deliver a left side kick to the head, planting your left foot to 1:30 in a transitional front twist stance." },
            { "text": "Step out of the twist with your right foot into a right stomp to 3:00; you are now in a modified left reverse bow (body facing 9:00, head facing 3:00)." },
            { "text": "Step-through reverse with your left foot into a transitional left neutral bow facing 3:00, stomping the attacker’s ankle." }
          ]
        },
        {
          "title": "SET 7: Backbreaker",
          "steps": [
            { "text": "As the 4:30 attacker throws a right punch, step to 4:30 with your right foot while doing a left inward parry followed by a right outward parry to deflect the punch." },
            { "text": "Slide your right foot all the way back to 4:30 (clockwise) into a left neutral bow facing 10:30; execute a right eye hook to the right eye and grab both shoulders." },
            { "text": "Immediately after planting your right foot, deliver a right knee to the back of the spine and plant back to 4:30 into a left forward bow, pulling the attacker down onto your left knee." },
            { "text": "With your left hand holding the head, deliver a right heel palm across the face followed by a right heel palm claw, raking back toward you." },
            { "text": "Raise both hands high and drive double back knuckles down across the collarbones." },
            { "text": "Circle the hands up and, as you step back to 4:30 with your left foot, drive both hands down into double heel palm claws to chest and face." },
            { "text": "Torque clockwise into a right rotating twist stance while packing your hands at your right hip." },
            { "text": "Step out of the twist with your left foot into a right stomp to 9:00; you are now in a modified right reverse bow (body facing 3:00, head facing 9:00)." },
            { "text": "Step-through reverse with your right foot into a transitional right neutral bow facing 9:00, stomping the attacker’s ankle." }
          ]
        },
        {
          "title": "SET 8: Backbreaker",
          "steps": [
            { "text": "As the 7:30 attacker throws a left punch, step through to 7:30 with your right foot while doing a right inward parry followed by a left outward parry to deflect the punch." },
            { "text": "Slide your left foot all the way back to 7:30 (counterclockwise) into a right neutral bow facing 1:30; execute a right eye hook to the right eye and grab both shoulders." },
            { "text": "Immediately after planting your left foot, deliver a left knee to the back of the spine and plant back to 7:30 into a right forward bow, pulling the attacker down onto your right knee." },
            { "text": "With your right hand holding the head, deliver a left heel palm across the face followed by a left heel palm claw, raking back toward you." },
            { "text": "Raise both hands high and drive double back knuckles down across the collarbones." },
            { "text": "From the previous strike, circle hands up and, as you step back to 7:30 with your left foot, drive both hands down into double heel palm claws to chest and face." }
          ]
        },
        {
          "title": "SET 9: Hopping Crane",
          "steps": [
            { "text": "Pack hands at your left hip as you step to 3:00 with your left foot into a transitional left front twist stance." },
            { "text": "Step out of the twist toward 12:00 with a right stomp to 12:00 and hop once on your right foot forward." },
            { "text": "Plant your left foot to 10:00 and do a right sweep to 10:30 followed by a right low side kick to 4:30." }
          ]
        },
        {
          "title": "SET 10: Hopping Crane",
          "steps": [
            { "text": "Pack hands at your right hip as you step to 9:00 with your right foot into a transitional right front twist stance." },
            { "text": "Step out of the twist toward 12:00 with a left stomp to 12:00 and hop once on your left foot forward." },
            { "text": "Plant your right foot to 2:00 and do a left sweep to 1:30 followed by a left low side kick to 7:30." }
          ]
        },
        {
          "title": "SET 11: Sleeper",
          "steps": [
            { "text": "Rotate clockwise in place into a right cat stance facing 6:00 with your left handsword straight out at chest height and your right handsword low in line with (and above) your right leg." },
            { "text": "As the 6:00 attacker throws a right punch, drop your right heel and step through with your left foot into a left neutral bow facing 6:00 while doing a left inward block." },
            { "text": "Slide your right foot up to your left into a left close kneel stance, deliver a right ridge hand at face level (meeting the block in the form) and step behind the attacker with your right foot." },
            { "text": "Slide your left foot counterclockwise around your right foot into a right neutral bow facing 12:00 while delivering a left outward (left-to-right) claw to the face with a right downward back knuckle, followed by a left pushdown block as you move into a right forward bow facing 12:00." }
          ]
        },
        {
          "title": "SET 12: Sleeper",
          "steps": [
            { "text": "Step through reverse into a left neutral bow." },
            { "text": "Slide your left back into a left cat stance facing 12:00 with your right handsword straight out at chest height and your left handsword low in line with (and above) your left leg." },
            { "text": "As the 12:00 attacker throws a left punch, drop your left heel and step through with your right foot into a right neutral bow facing 12:00 while doing a right inward block." },
            { "text": "Slide your left foot up to your right into a right close kneel stance, deliver a left ridge hand at face level (meeting the block in the form) and step behind the attacker with your left foot." },
            { "text": "Slide your right foot clockwise around your left foot into a left neutral bow facing 6:00 while delivering a right outward (right-to-left) claw to the face with a left downward back knuckle, followed by a right pushdown block as you move into a left forward bow facing 6:00." }
          ]
        },
        {
          "title": "SET 13: Brushing The Storm",
          "steps": [
            { "text": "As the 6:00 attacker throws a right overhead club, step through forward into a right high wide kneel while doing a left inward parry into the club and a right heel palm to the face." },
            { "text": "Sink into your stance while delivering a right upward elbow to the ribs." },
            { "text": "While stepping to 6:00 with your left foot, deliver a right heel palm to the groin (keep contact from elbow through heel palm)." },
            { "text": "While stepping back to 4:30 with your right leg into a left forward bow facing 10:30, slide your right hand down the thigh, grab and lift the leg while delivering a left inward elbow to the kidney to knock the attacker forward." },
            { "text": "Deliver a left front scoop kick to the groin, landing your left foot back to 6:00 in a right neutral bow facing 12:00." }
          ]
        },
        {
          "title": "SET 14: Brushing The Storm",
          "steps": [
            { "text": "As the 12:00 attacker throws a left overhead club, step up with your left foot to 12:00 into a left high wide kneel while doing a right inward parry into the club and a left heel palm to the face." },
            { "text": "Sink into your stance while delivering a right upward elbow to the ribs." },
            { "text": "While stepping to 12:00 with your right foot, deliver a left heel palm to the groin (keep contact from elbow through heel palm)." },
            { "text": "While stepping back to 1:30 with your left leg into a right forward bow facing 7:30, slide your left hand down the thigh, grab and lift the leg while delivering a right inward elbow to the kidney to knock the attacker forward." },
            { "text": "Deliver a right front scoop kick to the groin, landing your right foot back to 1:30 in a modified left neutral bow facing 9:00." }
          ]
        },
        {
          "title": "SET 15: Falling Falcon",
          "steps": [
            { "text": "As the 9:00 attacker does a right-handed push to your left shoulder, pin the hand against your upper chest with your left hand as you step forward into a modified right neutral bow to 9:00 with a right upward elbow into the shoulder." },
            { "text": "Turn counterclockwise into a left forward bow facing 3:00 while maintaining the pin with your left hand and pushing with your right elbow to take the attacker down." },
            { "text": "Grab the back side of the attacker’s right wrist with your right hand (release the left) and turn it clockwise (exposing the elbow to 3:00) as you deliver a left heel palm to the elbow." },
            { "text": "Deliver a left knee to the elbow and a left side kick to the right side of the neck." },
            { "text": "Plant your left foot back to 1:30 as you grab the back side of the attacker’s right wrist with your left hand (release the right) and turn it counterclockwise (exposing the elbow to 12:00) as you deliver a right heel palm to the elbow." },
            { "text": "Deliver a right glancing knee to the elbow, let the leg pass the arm, then drive a right scraping heel kick to the kidney, up and down into a right retarded ball kick to the solar plexus, landing your right foot to 3:00 in a transitional right front twist stance. Unwind into a right neutral bow." }
          ]
        },
        {
          "title": "SET 16: Falling Falcon",
          "steps": [
            { "text": "As the 3:00 attacker does a left-handed push to your right shoulder, pin the hand against your upper chest with your right hand as you step forward into a modified left neutral bow to 3:00 with a left upward elbow into the shoulder." },
            { "text": "Turn clockwise into a right forward bow facing 9:00 while maintaining the pin with your right hand and pushing with your left elbow to take the attacker down." },
            { "text": "Grab the back side of the attacker’s left wrist with your left hand (release the right) and turn it counterclockwise (exposing the elbow to 9:00) as you deliver a right heel palm to the elbow." },
            { "text": "Deliver a right knee to the elbow and a right side kick to the left side of the neck." },
            { "text": "Plant your right foot back to 1:30 as you grab the back side of the attacker’s left wrist with your right hand (release the left) and turn it clockwise (exposing the elbow to 12:00) as you deliver a left heel palm to the elbow." },
            { "text": "Deliver a left glancing knee to the elbow, let the leg pass the arm, then drive a left scraping heel kick to the kidney, up and down into a left retarded ball kick through the solar plexus, planting to 3:00 into a left neutral bow facing roughly 9:00." }
          ]
        },
        {
          "title": "SET 17: Circling The Horizon",
          "steps": [
            { "text": "As the 12:00 attacker throws a right punch, rotate clockwise and slide your right foot back into a cat stance (facing 12:00) while doing a left inward block and a right uppercut to the right temple." },
            { "text": "Step out with your right foot into a right neutral bow while delivering a right inward elbow to the ribs." },
            { "text": "Drop onto your left knee and deliver a right handsword to the back of the attacker’s right knee." },
            { "text": "From the handsword, circle your hand out to the right and back into the solar plexus while thrusting your right leg to the right to sweep the attacker." },
            { "text": "While still on your left knee, slide your right foot back, lift it, and deliver a right heel kick to the solar plexus." },
            { "text": "Stand up into a right neutral bow facing 12:00." }
          ]
        },
        {
          "title": "SET 18: Circling The Horizon",
          "steps": [
            { "text": "As the 6:00 attacker throws a left punch, rotate counterclockwise and slide your left foot back into a cat stance while doing a right inward block and a left uppercut to the left temple." },
            { "text": "Step out with your left foot into a left neutral bow while delivering a left inward elbow to the ribs." },
            { "text": "Drop onto your right knee and deliver a left handsword to the back of the attacker’s left knee." },
            { "text": "From the handsword, circle your hand out to the left and back into the solar plexus while thrusting your left leg to the left to sweep the attacker." },
            { "text": "While still on your right knee, slide your left foot back, lift it, and deliver a left heel kick to the solar plexus." }
          ]
        },
        {
          "title": "SET 19: Leaping Crane",
          "steps": [
            { "text": "As the 12:00 attacker throws a right punch, leap left into a left crane stance while striking the forearm with a right half fist (low) as your left hand executes a high inward parry." },
            { "text": "Deliver a right side kick to the back of the attacker’s right knee to buckle the leg." },
            { "text": "Deliver a right back knuckle to the kidney as you land from the kick." },
            { "text": "Deliver a right inward elbow to the right mastoid and a left inward handsword to the left mastoid to sandwich the head." },
            { "text": "Wrap your right arm over the head, rip to the right, and return with a right inward handsword to the face." },
            { "text": "Execute a front chicken kick (right then left) landing in a left neutral bow facing 12:00." }
          ]
        },
        {
          "title": "SET 20: Leaping Crane",
          "steps": [
            { "text": "As the 12:00 attacker throws a left punch, leap right into a right crane stance while striking the forearm with a left half fist (low) as your right hand executes a high inward parry." },
            { "text": "Deliver a left side kick to the back of the attacker’s left knee to buckle the leg." },
            { "text": "Deliver a left back knuckle to the kidney as you land from the kick." },
            { "text": "Deliver a left inward elbow to the left mastoid and a right inward handsword to the right mastoid to sandwich the head." },
            { "text": "Wrap your left arm over the head, rip to the left, and return with a left inward handsword to the face." },
            { "text": "Execute a front chicken kick (left then right) landing in a right neutral bow facing 12:00." }
          ]
        }
      ],
      "notes": [
        "Form opens at the praying-hands portion of the salutation.",
        "Technique form emphasizing takedowns."
      ]
    }
  ]
}
