{
  "forms": [
    {
      "name": "Short Form 3",
      "beltSlug": "brown",
      "intro": "This is the first form built purely from techniques. We focus on flow between techniques. Descriptions are brief—click any highlighted technique name for a full breakdown. Forms may alter or truncate techniques to emphasize full ranges of motion.",
      "sets": [
        {
          "title": "SET 1: Destructive Twins",
          "steps": [
            { "text": "From an attention stance, step forward into a right neutral bow while doing a left horizontal punch to the face and a right uppercut punch to the groin." },
            { "text": "Left hand pins across your chest, then right inward block into a left outward block while moving into a right forward bow." },
            { "text": "Left four-finger eye poke to attacker’s face, then left hand cocks back to your waist as you do a right horizontal thrust punch low." },
            { "text": "Slide your right leg back into a cat stance as you bring both hands down in front of you (palms up); step forward into a right neutral bow while bringing hands up, flicking the eyes, then execute double thumb pokes to the eyes." }
          ]
        },
        {
          "title": "SET 2: Crashing Wings",
          "steps": [
            { "text": "Step right side into horse stance while doing two downward elbows to the attacker’s forearms." },
            { "text": "Left foot slides to your right, then shoots back to 7:30 into a right reverse bow (body facing 1:30, head facing 7:30)." },
            { "text": "Pivot left into a left neutral bow facing 7:30 while doing a left side elbow to the face with a right inward hammerfist to the solar plexus, ending in a left forward bow facing 7:30." }
          ]
        },
        {
          "title": "SET 3: Twirling Wings",
          "steps": [
            { "text": "Slide your right foot to your left, then step back to 3:00 with your right foot, turning right into a right forward bow as you do a right outward block and left inward elbow." }
          ]
        },
        {
          "title": "SET 4: Circling Wings",
          "steps": [
            { "text": "As you step to 1:30 with your left foot into a left forward bow, pull your right arm across your body to pin the attacker’s hand on your neck." },
            { "text": "Do a right downward elbow (clearing the arm from your neck), grab the attacker’s right arm with your right hand and pull in while doing a left two-finger eye poke." },
            { "text": "Do a right upward elbow to the face and turn left into a left reverse bow while doing a right hammerfist to the groin." }
          ]
        },
        {
          "title": "SET 5: Crossing Talons",
          "steps": [
            { "text": "Grab your right wrist with your left hand and settle into a transitional horse stance." },
            { "text": "Step to 7:30 with your left foot into a horse stance (facing 10:30) and do a left outward elbow into a left overhead downward elbow." }
          ]
        },
        {
          "title": "SET 6: Scraping Hoof",
          "steps": [
            { "text": "Stand up as you slide your left foot toward your right while doing a back head-butt, shooting fists down in front of you and cocking your right foot (ball of foot up)." },
            { "text": "Right heel kick to attacker’s left shin (behind you), followed by a right side kick to attacker’s right shin (behind you), then stomp down on the foot." }
          ]
        },
        {
          "title": "SET 7: Fatal Cross",
          "steps": [
            { "text": "Bring your right foot to your left into a left cat stance while hooking your hands out and back past your hips; simultaneously execute a forward head-butt." },
            { "text": "As you step forward into a right neutral bow, execute double uppercuts to the solar plexus." },
            { "text": "Pull arms back to chest (crossed—left on top), then strike out with crossed double back-knuckles to the face." },
            { "text": "Pull arms back to chest (crossed—left on top), then extend into crossed double eye pokes (keep fingers even)." }
          ]
        },
        {
          "title": "SET 8: Grip of Death",
          "steps": [
            { "text": "Step to 12:00 with your left foot and drag your right leg up into a left close kneel stance as you do a left inward hammerfist to the groin and a right inward hammerfist to the kidney." },
            { "text": "Right hand tracks up the back, hooks the chin and anchors as you turn to 6:00 into a right forward bow and do a left heel-palm to the face; as you heel-palm, wrap your right arm around your back." }
          ]
        },
        {
          "title": "SET 9: Locked Wing",
          "steps": [
            { "text": "Counter-grab with your right hand, then execute an inverted step-through reverse (left leg steps back to 4:30 behind your right) with a left rear elbow to the face." },
            { "text": "Left arm continues down to wrap the attacker’s right arm and shoots forward and down (palm up)." },
            { "text": "Bring your left fist up to your left shoulder (trapping the arm) as you step back with your right foot." },
            { "text": "Release your right hand and bring it forward on top of the attacker’s head as you step through with a right knee strike to the face, landing to 10:30." }
          ]
        },
        {
          "title": "SET 10: Crossed Twigs",
          "steps": [
            { "text": "With both hands at your side, step to 10:30 with your left foot leading with both hands (pulling the attacker off balance)." },
            { "text": "Turn right while doing a right side elbow to the face into an overhead downward elbow to the spine." },
            { "text": "Place both hands on the head and do a left knee to the face, planting back in your original position (horse stance facing 1:30)." }
          ]
        },
        {
          "title": "SET 11: Wings of Silk",
          "steps": [
            { "text": "With hands at your sides, your left hand pinches behind as your left foot stomps." },
            { "text": "Right upward obscure elbow to the chin with a right scoop kick to the groin as your left arm and shoulder sink." },
            { "text": "Right foot steps to the left of your left foot (in tight), then left foot steps around to the left of your right (turning 360° to end up beside the attacker)." },
            { "text": "With your left hand pinning the attacker’s arm to your chest, execute a right uppercut to break the elbow." }
          ]
        },
        {
          "title": "SET 12: Conquering Shield",
          "steps": [
            { "text": "Pin the attacker’s left hand on your chest with your left hand and step to 12:00 with a right front ball kick, while executing a right inward hammering block that rises upward." },
            { "text": "Right downward elbow to the bicep, right upward elbow to the chin, followed by a right downward heel-palm claw to the face." }
          ]
        },
        {
          "title": "SET 13: Striking Serpent’s Head",
          "steps": [
            { "text": "Step back to 7:30 with your right foot with your right hand checking at face level as you deliver a left inward back-knuckle to the back of the head (toward your face)." },
            { "text": "Anchor your left elbow and execute a right half-fist (palm down) to the face." },
            { "text": "Step counter-clockwise with your right foot to 3:00 into a horse stance facing 12:00 and move up to attention stance." }
          ]
        }
      ],
      "footerNotes": [
        "Short 3 is known as the elbow form.",
        "Clock angles are all from your original position."
      ]
    }
  ]
}
